{"data":{"allHRmanagerJob":{"edges":[{"node":{"Id":145317,"Name":"Account Manager","ShortDescription":"","AdvertisementUrl":"https://candidate.hr-manager.net/ApplicationInit.aspx?cid=1279&ProjectId=145317&DepartmentId=18984&MediaId=5","LastUpdated":"/Date(1555505498000+0200)/","Created":"/Date(1555505059000+0200)/","Advertisements":[{"Content":"Vill du jobba som säljare med ett eftertraktat fullserviceerbjudande, stort ansvar och tillhörighet i kundteam? Med vårt breda erbjudande kan vi på EVRY göra i princip allt som våra kunder efterfrågar. Våra innovativa partnerskap och kunder inom privat och offentlig sektor gör att du samtidigt får vara med och forma den digitala framtiden. \r\n\r\n\r\nVi erbjuder dig\r\nVår storlek är vår styrka. Som ett av Nordens ledande IT-bolag erbjuder vi dig fler möjligheter än likvärdiga företag. Våra säljare tycker det är roligt att jobba hos oss! Vi har stor geografisk spridning i Sverige och världen – våra kunder är små som stora, välkända som okända, lokala som globala. Vår bredd, tillsammans med en hög förändringstakt, ger dig kraft att utvecklas. Vi strävar efter att vara en modern och attraktiv arbetsplats. Därför bygger vi arbetsgrupper med stor mångfald för att ta tillvara och utveckla kompetens och nytänkande. Hos oss i Göteborg får du en plats i ett framtidsdrivet nationellt team om 13 säljare. \r\n \r\nSå här jobbar vi\r\nVi har höga ambitioner – och vi ska ligga i teknisk framkant. På EVRY brinner vi för kreativa lösningar och är alltid nyfikna på vad som blir nästa digitala genombrott som matchar våra kunders behov. Eftersom teknik är en färskvara, är vårt arbetssätt agilt, vilket kräver att du har förmågan att blicka framåt.  \r\nTjänsten som Account Manager innebär att sälja in hela vårt erbjudande gentemot små och medelstora företag (SME) regionalt inom Göteborg. Du kommer att få chans att utveckla befintliga kunder, samtidigt som ett stort fokus ligger på att aktivt söka upp affärsmöjligheter och att identifiera nya konton som har behov av den nya tekniken. \r\n \r\nDu behöver ta eget ansvar och självständigt planera och prioritera din tid. Vi värdesätter en god balans mellan arbete och fritid, samtidigt som vi ställer krav på resultat. \r\n \r\nÄr du den vi söker?\r\nMed vårt stora kundfokus behöver du vara serviceminded, ha en positiv inställning och god känsla för kvalitet. Vår höga förändringstakt kräver också att du är flexibel, självständig och att du motiveras av att lyckas. Du gillar att jobba i team, är nyfiken och har ett naturligt sätt som kunderna gillar. \r\n \r\nFör att trivas som Account Manager hos oss identifierar du dig med våra värderingar: \r\n\r\n    Empower & Inspire – Sprid energi! \r\n    Anticipate needs – Fånga möjligheter, initiera förändring \r\n    Go beyond expectations – Våga, och tänk annorlunda \r\n    Perform together – Var nyfiken, öppen och ha kul! \r\n\r\nDu har erfarenhet ifrån lösningsorienterad B2B- och tjänsteförsäljning samt en akademisk bakgrund. Utveckling och innovation inom IT intresserar dig och du har ett väletablerat nätverk inom branschen. Ditt engagemang är imponerande och du drivs av att uppnå goda säljresultat. \r\n  \r\nAtt hantera, planera och prioritera din arbetsvardag, som bland annat innebär högt tempo och aktiv kundbearbetning, gör du med enkelhet. För att lyckas i rollen som säljare har du viljan och förmågan att förstå kundens verksamhet och kan omsätta det i förändringsarbete där framtidens IT-system och -verktyg är ett måste. \r\n \r\nLåter det intressant? \r\nI denna rekrytering samarbetar vi med SalesOnlys seniora rekryteringskonsult Kajsa Sandén och researcher Amanda Klippinge. Intervjuer sker under vecka 18-20. Önskas ytterligare information kring tjänsten är du välkommen att kontakta Kajsa på tel: 073-521 65 31 eller Amanda på tel: 076-5259054. Alla ansökningar och kontakter behandlas konfidentiellt. SalesOnly får inte längre ta emot eller hantera ansökningar som inkommer via mail då detta strider mot direktiven i GDPR. Ansök via länken här! \r\n \r\nOm EVRY\r\nVi hjälper våra kunder att få konkret nytta av IT genom hela värdekedjan, från lösningar och konsulttjänster till outsourcing. Du använder dig av lösningar som vi har skapat, t ex när du: \r\n\r\n    Bokar din tågbiljett online \r\n    Får digitalt meddelande om en paketleverans \r\n    Designar ditt nya kök hos din återförsäljare \r\n    Besöker sjukhuset och din läkare kollar din medicinska historia i din journal \r\n    Får ett meddelande från din bank att ett kortbedrägeriförsök stoppats \r\n"}]}}]}}}