{"data":{"allFeedsb1Digital":{"edges":[{"node":{"title":"Velkommen til Bankbokklubben","link":"https://medium.com/sparebank1-digital/velkommen-til-bankbokklubben-2333a05343b8?source=rss----e3c741b0efee---4","content":{"encoded":"<p>En hel klokketime dedikert til et spennende tema, med ivrig diskusjon blant vennlige og motiverte folk på søken etter innsikt og læring, i kombinasjon med en god kopp kaffe. Kan man egentlig starte dagen på en bedre måte?</p><p>Hver onsdag morgen møtes Bankbokklubben i SpareBank 1 Utvikling på en kafe i nærheten av kontoret for å prate om det siste kapittelet i en bok vi leser sammen. Hvorfor gjør vi dette?</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/545/1*0Zfz1UVZd1G-qOBV2ciEpg.png\" /></figure><p>Formålet med klubben er læring med en felles rytme gjennom fordypning i utvalgte bøker innen vårt interessefelt. Fremgangsmåten følger gjerne et slikt mønster:</p><ul><li>Gruppen blir enige om valg av ny bok. Kandidatlisten inneholder som regel en rekke godbiter, og det smerter å måtte velge bort de fleste.</li><li>En avtalt del av boken leses på egenhånd, f. eks. et kapittel eller to.</li><li>På det ukentlige klubbmøtet diskuteres hovedpunktene i kapittelet. Hva betyr dette for oss i SpareBank 1 Utvikling, og hvordan kan vi teste ut elementer vi har lyst til å undersøke nærmere?</li><li>Rett som det er gjennomfører vi små eksperimenter og diskutere betydningen av funnene.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*RoQS4PSXvBpga2EwESxr6w.jpeg\" /><figcaption>Bankbokklubben i SpareBank 1 Utvikling tar en pause i diskusjonen av hva boken <a href=\"https://www.amazon.com/gp/product/B013UWFM52/ref=dbs_a_def_awm_hsch_vapi_tkin_p1_i0\">Deep Work</a> byr på av innsikt, muligheter og utfordringer.</figcaption></figure><p>Hvorfor fungerer dette for oss?</p><ul><li>Vi jobber med utrolig mange flinke folk, og det er interessant og nyttig med bredden i perspektiv dette skaper.</li><li>Man kommer dypere i materialet gjennom diskusjon og repetisjon.</li><li>Innsatsen som legges ned gjøres overkommelig ved å dele opp en bok i mindre bolker.</li><li>Det blir enklere å lese ved en positiv forpliktelse i det å møtes for å jobbe videre med materialet sammen.</li><li>Man kommer i kontakt med interessante temaer og tilegner seg innsikt man trolig ellers ikke ville oppnådd på egenhånd.</li><li>Vi pleier en felles interesse i det å fordype seg i fag og læring innen vårt fagområde.</li><li>Det er hyggelig å være sammen. Vi styrker samholdet i gruppa og lærer hverandre å kjenne enda bedre. Dette skjer på tvers av grupperingene vi jobber mest i.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*2-owst8t2EPr-WDPCZhuTg.jpeg\" /><figcaption>Med mange sterke kandidater er nåløyet trangt for å bli valgt som felles bok i Bankbokklubben.</figcaption></figure><p>Bankbokklubbens opprinnelse kan spores tilbake til da det interne utviklingsmiljøet i selskapet ble etablert. I løpet av denne perioden ble en lesesirkel benyttet for å gå gjennom og jobbe med innholdet i boken <a href=\"https://www.amazon.com/Toyota-Way-Management-Principles-Manufacturer/dp/0071392319\">The Toyota Way.</a> Hver enkelt leste først et kapittel for seg, som så ble diskutert i gruppen med fokus på hva innholdet betydde for miljøet vårt. Dette skapte en felles plattform, og ga mye energi, til arbeidet med hvordan arbeidsprosesser og -miljø ble etablert og videreutviklet. Da siste kapittel var avsluttet, og boken lagt til side, var det flere oss som kjente på den samme følelsen. Den positive dynamikken fra lesesirkelen ville vi svært gjerne beholde. Dermed gikk det ikke lang tid før Bankbokklubben var etablert.</p><p>Her er et utvalgt av våre favorittbøker:</p><ul><li><a href=\"https://www.amazon.com/Culture-Code-Secrets-Highly-Successful/dp/0525492461\">Culture code</a></li><li><a href=\"https://www.amazon.com/This-Lean-Resolving-Efficiency-Paradox-ebook/dp/B00JZZS7Q0\">This is Lean</a></li><li><a href=\"https://www.amazon.com/Loonshots-Nurture-Diseases-Transform-Industries/dp/1250185963\">Loonshots</a></li><li><a href=\"https://www.amazon.com/Accelerate-Software-Performing-Technology-Organizations/dp/1942788339\">Accelerate</a></li><li><a href=\"https://www.amazon.com/Good-Great-Some-Companies-Others/dp/0066620996\">Good to Great</a></li><li><a href=\"https://www.amazon.com/Lean-Enterprise-Performance-Organizations-Innovate/dp/1449368425\">Lean Enterprise</a></li><li><a href=\"https://www.amazon.com/Phoenix-Project-DevOps-Helping-Business/dp/0988262592\">The Phoenix Project</a></li></ul><p>For tiden leser klubben boken <a href=\"https://www.amazon.com/gp/product/B013UWFM52/ref=dbs_a_def_awm_hsch_vapi_tkin_p1_i0\">Deep Work</a> og diskuterer ting som: Hva er et godt mønster for bruk av tiden vår, for hver enkelt og for gruppene man er del av? Hva er gode strategier for å oppnå en slik tilstand for kunnskapsarbeidere? Hvordan bør vi måle bruk av egen tid, og hvilke eksperimenter kan vi enkelt gjennomføre for å etablere data og innsikt?</p><p>Plutselig er en time over. Tiden formelig fløy avgårde, og vi er klare for å gyve løs på resten av dagen. Vel vitende om at nok et spennende kapittel venter for Bankbokklubbens medlemmer i uken som kommer.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=2333a05343b8\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/velkommen-til-bankbokklubben-2333a05343b8\">Velkommen til Bankbokklubben</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Kristoffer Berg"}},{"node":{"title":"Utvikleravdelingen er død! Lenge leve utvikleravdelingen!","link":"https://medium.com/sparebank1-digital/utvikleravdelingen-er-d%C3%B8d-lenge-leve-utvikleravdelingen-d4596a33ea89?source=rss----e3c741b0efee---4","content":{"encoded":"<p>Vi har vært på reisen med kryssfunksjonelle team hver dag siden 2014. Vi jobber så svetten siler med å gi teamene våre best mulig forutsetninger for å løse oppgavene sine.</p><p>Plutselig en dag oppdaget vi at vi hadde kastet ut babyen med badevannet. Vi hadde optimalisert vekk utviklerkulturen vår.</p><p>Hva var det egentlig som hadde skjedd?</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*S3t-mxId-uOiS1h9VPPzew.jpeg\" /><figcaption>Foto fra BigStock</figcaption></figure><h3>Bakteppet</h3><p>Vi kan takke Frederick Taylor (1856–1915) for mye. Han populariserte standardisering av arbeidsmetoder. Dette gav oss massiv økning i produksjonsvolum for fabrikker over hele verden. Med på lasset fikk vi også med oss ledelsesprinsipper for å maksimalisere effektiviteten:</p><ul><li>Finn beste måte å gjøre en oppgave på</li><li>Dokumenter beste måte å gjøre oppgaven på</li><li>Tren opp medarbeiderne til å gjøre oppgavene på beste måte</li><li>Ledere og medarbeidere deler ansvaret for løsning av oppgavene. Lederne skal løse oppgavene de er bedre egnet til, heller enn medarbeiderne</li></ul><p>En av utfordringene med disse, er at de har større fokus på å optimalisere enkeltroller heller enn systemet. I tillegg er ledelsesprinsippene er ofte blitt mistolket, eller brukt i feil kontekst. Mange mistolker dem fortsatt, over hundre år etterpå:</p><ul><li>en bruker rammeverket på arbeidsoppgaver det aldri var ment for å løse</li><li>en ser bort i fra de kontinuerlige treningsaspektet, dvs. dropper kontinuerlig forbedring</li></ul><p>Ta dette og bland det med tradisjonell avdelingsorganisering i underavdelinger som hver for seg er optimalisert for å være så effektive som mulig, dvs at alle i avdelingen til en hver tid jobber opp mot 100 prosent kapasitet, så har vi en standard bedrift. Deler av utfordringene med tradisjonell avdelingsorganisering har vi også erfart i SpareBank 1 IT.</p><h3>Avdelingsdrevet utvikling</h3><p>Vi hadde konseptavdeling, arkitektavdeling, prosjektavdeling, forvaltningsavdeling og driftsavdeling. Nye løsninger ble tatt fram i midlertidige prosjektteam, hvor utviklere var leid inn kun med tanke på å utvikle den ene løsningen. Arkitekter støttet opp om prosjektteamet. Arkitektenes utfordring var mange. De var gjerne booket opp i flere prosjekter samtidig , de var få, og de var fullt ut prosjektfinanisert. Dermed fikk de sjelden mulighet til å dykke dypt ned i utviklingen — de måtte løpe til neste prosjekt.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/300/1*xjCIq4ThHVdbvTfYM95IEg.png\" /><figcaption>Avdelinger med forskjellige mål — et system optimalisert for konflikt</figcaption></figure><p>Når løsningen var ferdig kodet og testet, ble den overlevert til forvaltningsteamet. Dette tok gjerne flere uker, siden koden sjelden var i henhold til standard, og måtte rettes og retestes før handoveren ble godkjent.</p><p>Denne måten å jobbe på førte til lav tillit mellom avdelingene, og fremmedgjøring for de som jobbet i dem med de aktuelle løsningene.</p><h3>Mikrotjenestene gav oss team</h3><p>Som så mange andre, hadde også vi en stor monolitt som alle de nye løsningene ble merget inn i. Vi fikk større og større utfordringer med å levere i monolitten, og dette medførte at vi startet et arkitekturprosjekt i 2012 for å bryte den opp i flere mindre tjenester — la oss kalle dem mikrotjenester. Da vi gjorde dette, bestemte vi oss for å bruke verdikjedeinngangen for å finne fornuftige deler å dele monolitten opp i.<a href=\"https://lightstep.com/blog/the-only-good-reason-to-adopt-microservices/\"> Da ble det også naturlig å lage team rundt verdikjedene</a>. Dette var starten på de kryssfunksjonelle teamene våre. Med stabile team organisert rundt verdikjedene, fant vi svar på mange av utfordringene vi hadde hatt med den avdelingsdrevne utviklingen.</p><h3>Egne utviklere</h3><p>Vi hadde hatt 100 prosent konsulentdrevet utvikling fram til 2012. Vi startet reisen med egne utviklere omtrent samtidig som vi startet reisen med microtjenester. I starten var vi totalt omtrent 50 personer som jobbet sammen i et fåtall team og omtrent ti av oss var ansatte utviklere og testere. Vi jobbet sammen, og hadde hyppige avdelingsmøter sammen.</p><p>Entusiasmen var høy. I tillegg til å få en mer moderne arkitektur, hadde vi skapt oss et rammeverk som gjorde at vi kunne skalere opp til å støtte flere verdikjeder — og dermed også flere team. Det gjorde vi. I 2017 var vi blitt 15 team.</p><p>Samtidig hadde vi ikke evnet å rekruttere egne utviklere i et like høyt tempo. i 2017 var vi gått fra omtrent 10 til omtrent 25 fast ansatte utviklere. Brorparten av skaleringen var gjort med konsulenter.</p><h3>Oppsigelser</h3><p>I løpet av seks måneder vinteren 2017–2018 sa seks av utviklerne våre opp.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/967/1*01xfKd_jsaYqRRPp3BZXiw.png\" /></figure><p>Hva var det som hadde skjedd?</p><p>Det viste seg at vi hadde jobbet så mye med å skape optimale arbeidsforhold for de kryssfunksjonelle teamene våre, at vi hadde kastet ut babyen med badevannet.</p><p>I reisen fra et fåtall til da 15 team, ble utviklerne våre spredd tynnere og tynnere utover teamene. Med 25 utviklere på 15 team, så vil de fleste utviklerne enten være ensom som fast ansatt utvikler på teamet sitt, eller i beste fall har en utviklerkollega til i teamet. Den gangen vi var 10 stykker og et fåtall team, så vi hverandre og delte kaffemaskin hver dag. I 2017 var vi blitt 15 team spredd over tre etasjer. Vi traff ikke hverandre lenger. Utviklerkulturen vår var blitt anonym. Tilhørigheten var borte.</p><h3>Utviklerne går sammen</h3><p>Oppsigelsene gav oss en skikkelig vekker. Sluttsamtalene var entydige. De som sluttet, følte liten tilhørighet til SpareBank 1 og var ikke fornøyd med den faglige utviklingen sin.</p><p>Sommeren og høsten 2018 la vi opp til en rekke grep for å snu dette helt om. Vi ville skape et skikkelig bra fagmiljø med mye sosial trygghet og mye humør. Et sted det er godt å være.</p><p>Vi gjorde to fundamentale grep:</p><ul><li>Vi satte opp utviklerne som en egen fagavdeling. Vi hadde tidligere vært organisert sammen med flere andre disipliner</li><li>Vi innførte ukentlig fagdag. Du kan lese mer om fagdagen vår <a href=\"https://medium.com/sparebank1-digital/torsdag-er-den-nye-lørdagen-f547e55aadd3\">her</a></li></ul><h3>Fagavdelinger + kryssfunksjonelle team = sant</h3><p>For å bygge sosial trygghet og sosial tilhørighet i en hverdag hvor en jobber i kryssfunksjonelle team, er fagavdelingene våre blitt viktigere enn noen gang. I fagavdelingen har vi et fast møtepunkt. Der bygger vi kulturen vår, jobber sammen og blir bedre utviklere sammen. Vi mener dette er så viktig at vi bruker en hel dag hver uke på dette. Dette gir oss muligheten til å jobbe sammen på arkitekturutfordringer, ta kurs sammen, jobbe aktivt med blogg- og konferanseinnlegg, og jobbe med personal, rekrutterings- og brandingsaktiviteter. Ved å være sammen og jobbe sammen med disse aktivitetene, skaper vi også sosial tilhørighet og trygghet. Vi skaper utviklerkulturen vår.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*F2JCCCDlIjGjFxcVhjT2Gw.jpeg\" /><figcaption>Fra standen vår på JavaZone.</figcaption></figure><h3>Faggruppene våre</h3><p>I tillegg til det strategiske kompetansearbeidet som foregår i fagavdelingene, gjør vi taktisk og operativt kompetansearbeid i faggruppene våre. Her er også konsulentene med, og de går gjerne på tvers av fagavdelinger. Vi har faggrupper for en rekke fagområder. Eksempler er teamledelse, applikasjonsarkitektur og sikkerhet.</p><h3>Shift left holder ikke</h3><p><a href=\"https://www.google.com/search?q=shift+left\">Shift left</a> er en trend som peker på at en skal flytte en rekke aktiviteter som tidligere typisk dukket opp sent i utviklingsprosessen, for eksempel test og sikkerhetsarbeid, tidligere i prosessen. Vi mener at dette på langt nær er nok for å skape en effektiv utviklingsprosess.</p><p>Du skal ikke bare “shift left” — du skal “rotate left”. Du skal bevege deg fra en horisonal avdelingsstruktur med handovers og ressursoptimalisering, til en vertikal verdikjedeorientert struktur, med kryssfunksjonelle team som jobber flytoptimalisert.</p><p>Vi må dyrke kulturen og den faglige tilhørigheten. Dette gjør vi i fagavdelingene og faggruppene våre. Samtidig er det i verdikjedene forretningsverdiene skapes. Da er de vi må optimalisere, og i de vi må jobbe.</p><p>Synes du dette var interessant, så pratet Jostein Emmerhoff og jeg mye mer om dette teamet på JavaZone 2019. Foredraget finner du <a href=\"https://www.pscp.tv/javazone/1MYxNPRBDOnGw?t=2m59s\">her</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=d4596a33ea89\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/utvikleravdelingen-er-d%C3%B8d-lenge-leve-utvikleravdelingen-d4596a33ea89\">Utvikleravdelingen er død! Lenge leve utvikleravdelingen!</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Vidar Moe"}},{"node":{"title":"Monorepo med Git och Maven: så fick vi det till!","link":"https://medium.com/sparebank1-digital/monorepo-med-git-och-maven-s%C3%A5-fick-vi-det-till-4fe01de16a1e?source=rss----e3c741b0efee---4","content":{"encoded":"<p>I SpareBank1 Utvikling har vi tagit i bruk ett monorepo för vår nya generation med appar i digitalbanken. Vi har utgått från verktyg som vi känner gott från tidigare: Git, Maven och Jenkins. Detta är verktyg som i stor grad är mer tillpassade får multirepo än monorepo.</p><p>Vi har tagit fram ett <a href=\"https://github.com/SpareBank1/monorepo-sample\">exempel-githubrepo</a> som visar hur vi har arbetat runt många av de utfordringarna som kommer särskilt från bruk av Maven och Jenkins. Repot visar också hur <a href=\"https://bazel.build\">Bazel-byggsystemet</a> kan användas som ett mer monorepo-native alternativ till Maven.</p><blockquote>Mer om monorepo kommer på JavaZone 2019: <a href=\"https://2019.javazone.no/program/eb8bc683-ceaf-4baf-82ee-d7b72960a955\">Monorepo med Git og Maven — hvordan lære gamle hunder ny triks</a>, 11 september kl 13:00 i rum 2.</blockquote><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Qxz_AwMSypWEHpIIwcCmzQ.jpeg\" /><figcaption>Bild av <a href=\"https://pixabay.com/sv/users/StartupStockPhotos-690514/?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=image&amp;utm_content=593313\">StartupStockPhotos</a> från <a href=\"https://pixabay.com/sv/?utm_source=link-attribution&amp;utm_medium=referral&amp;utm_campaign=image&amp;utm_content=593313\">Pixabay</a></figcaption></figure><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=4fe01de16a1e\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/monorepo-med-git-och-maven-s%C3%A5-fick-vi-det-till-4fe01de16a1e\">Monorepo med Git och Maven: så fick vi det till!</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Jonas Nordstrand"}},{"node":{"title":"Torsdag er den nye lørdagen","link":"https://medium.com/sparebank1-digital/torsdag-er-den-nye-l%C3%B8rdagen-f547e55aadd3?source=rss----e3c741b0efee---4","content":{"encoded":"<p><em>For en utvikler i SpareBank 1 Utvikling er hver torsdag dedikert til fag. Vi kaller det enkelt og greit Fagdag. Denne dagen brukes til å ta kurs, teste ut nye teknologier, lage helt nye løsninger eller gjøre forbedringer på felles kode.</em></p><p>Vi ønsker å dele det vi jobber med. Derfor bruker vi også Fagdagen til å lage artikler som denne, og til å forberede foredrag.</p><p>Som utvikler i SpareBank 1 er du medlem av et kryssfunksjonelt team. Organisatorisk og faglig er du en del av <em>Utvikleravdelingen</em>. Utviklere, testere og designere jobber sammen i de tverrfaglige teamene, men hver torsdag forlater utviklerne teamet sitt. Denne dagen finner utviklerne sammen for å jobbe med fag. Vi forsøker på denne må å skape en felles utviklerkultur i SpareBank 1 Utvikling.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*XG792BIxZDYtPzyFHRnusg.jpeg\" /><figcaption>Utvikling kan være så mangt! Her presenteres Hjernebank 1</figcaption></figure><h3>Kultur spiser strategi til frokost</h3><p>Peter Drucker skal ha sagt at “Culture eats strategy for breakfast”. Kort fortalt mente Drucker at kultur alltid vil vinne over struktur. Vi trenger struktur, men kulturen må underbygge strukturen. På QCon i mars var jeg på et foredrag med Randy Shoup. Han påstår at “<a href=\"https://qconlondon.com/2019-talk-videos\"><em>Kultur spiser strategi og organisering og teknologi og prosess og … til frokost</em></a><em>”</em>.</p><p>Vi tror på en kultur der deling, åpenhet og psykologisk trygghet er fundamentene. Med basis i denne kulturen bygger vi en organisasjon som støtter opp under disse verdiene. Når vi møtes hver torsdag er vi med på bygge denne kulturen. Vi deler kunnskap . Vi lærer og feiler sammen. Vi sosialiserer og vi blir bedre kjent. På denne måten blir vi tryggere på hverandre. Dette gjør det igjen enklere å kommunisere på tvers av teamene. Vi tror også at en god kultur gjør at våre dyktige utviklere ønsker å fortsette å være en del av SpareBank 1 over tid. Fakta er at siden vi startet med fagdagen har ingen utviklere avsluttet hos oss. Samtidig har vi blitt 13 nye utviklere i avdelingen.</p><h4>Flerkultur</h4><p>Når man har en kultur i teamet og en kultur i fagavdelingen, får man flerkulturelle utviklere. Om avstanden mellom “team-kultur” og “fag-kultur” er for stor, vil det kunne skape utfordringer. Resultatet kan bli at man ikke kjenner seg hjemme i fagavdelingen. <em>Utvikleravdelingen</em> i SpareBank 1 Utvikling er en ny avdeling. Når vi nå lager en felles kultur for denne avdelingen, må alle få være med å lage den. Fagdagen er en bra arena for dette. Vi har etablert to arbeidsgrupper. Den ene gruppen fokuserer på sosiale tiltak, mens den andre fokuserer på faglige tiltak. Dette har resultert i felles utflukter, middager og <a href=\"http://codingdojo.org/kata/\">kodekata</a>.</p><p>Sterke fagmiljø kan også være en utfordring. I en matriseorganiasjon kan det bli konflikt mellom teamene og fagavdelingene. Teamene er tett på kunden og har fokus på levere løsninger på en effektiv måte. For at et team skal bli effektivt jobbes det hele tiden teamkulturen. Stabilitet er et viktig element for effektive team. Endrer man sammensettning av personer i et team viser forskning at det tar tid å bygge effektiviteten opp igjen. Mye av grunnen er at endringer av denne typen påvirker den psykologiske tryggheten i teamet. Denne tryggheten er ikke bare nødvendig for å være effektiv, men også for innvoasjon (<a href=\"https://hbr.org/2008/03/is-yours-a-learning-organization\"><em>Edmondson, 2008</em></a>). På bakgrunn av dette er det derfor veldig viktig at teamene er tett innvolvert når fagavdelingen ansetter nye utviklere. Teamtilhørighet bør være avklart før ansettelsesprosessen starter og en representant fra teamet bør være med på intervjuene. På denne måten tror vi at vi skal klare å ansette utviklere som passer kulturen i både teamet og fagavdelingen.</p><h3>Snakk om kollega</h3><p>For å bli enda bedre kjent, har vi hver torsdag en quiz som vi kaller for <em>Snakk om kollega</em>. Alle har delt noen hemmeligheter med vår quiz master <a href=\"https://medium.com/@mwandishi.kazi\">Jan Erik Modal</a>. På bakgrunn av hemmelighetens vanskelighetsgrad får man poeng for riktig svar, og ikke minst minuspoeng om man svarer feil. Dette er en artig måte å bli kjent på og et fint avbrudd fra fagfokuset.</p><h3>Utviklerne gir tilbake</h3><p>For en leder er det ingen enkel avgjørelse å la utviklerne bruke 20% av sin tid utenfor teamet. Det er derfor viktig å vise resten av organisasjonen hva man gir tilbake. Vi har valgt å forløpende publisere alle aktiviteter som kommer fellesskapet til gode på en delt liste.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GO-_04uJ5plN17GHaEtHeA.png\" /><figcaption>Hva fagdagen brukes til</figcaption></figure><h3>Måling</h3><p>Fra første fagdag 13. desember i fjor, har vi målt tilfredshet med det sosiale og det faglige blant oss utviklere i SpareBank 1. Vi har brukt en skala fra 1 til 5, hvor 1 betyr svært lite tilfreds, og 5 betyr veldig tilfreds. Like før sommeren var det eksamen. Den ble gjennomført anonymt. Etter ett halvår med fagdag ønsket å måle hvor godt vi nå kjenner hverandre. Resultatet ble et gjennomsnitt på underkant av 80% riktige. Vi har dessverre ingen historiske resultater å måle mot. Vi vet derfor ikke om dette er et bra resultat, men magefølelsen tilsier at 80% riktige er bra.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*jXhqeYF-NImykqWISup2jQ.png\" /></figure><p>Utviklingen på bare 5 måneder har vært formidabel. Vi startet med en lite tilfredstillende måling i desember med en gjennomsnitlig tilferdshet på 2.41 for det sosiale, og 2.91 for det faglige. Utover vinteren og våren har gjennomsnittet beveget seg opp på 3 tallet, både for det faglige og det sosiale. Vår siste måling, utført 16. mai, ga oss <strong>4.16 </strong>for det sosiale. En økning på hele 79%! Den faglige tilfredsheten ble målt til <strong>4.37</strong>. En økning på imponerende 44%.</p><p>Dette er tall vi er utrolig fornøyde med. Spesielt glad er vi for den høye scoren på det sosiale. Fagdagen må ta mye av æren for dette. Men også aktiviteter som vennegrupper og fagsamling med overnatting har hatt en innvirkning. Vennegruppene er en ren kopi av barneskolens opplegg, men i stedet for å hoppe på en trampoline sammen, så spiller vi dart eller spiser god mat.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/690/1*EN1H0w8Bq1GYO4gE2lg2nA.png\" /></figure><h3>Veien videre</h3><p>Fagdagen var er et halvårlig eksperiment. Det er nå besluttet at dette er en fast aktivitet, og at vi skal bruke en dag i uken på fag. Det faktum at vi ikke har noen turnover og at vi i år skal ha fire bidrag på JavaZone, har vært med på å gjøre det enklere å ta denne avgjørelsen.</p><p>Ønsker du en ny oppdatering på hvordan det går med oss og fagdagen vår, kan du høre meg prate om dette på <a href=\"https://2019.javazone.no/program/a9d0cbc7-090e-4644-8e60-fcfadfaf0cda\">JavaZone onsdag 11. september</a> kl 12.20 i Rom 1.</p><h3>Anbefalt litteratur</h3><p>Jeg elsker å lese om kultur og organisasjon, og hver onsdag morgen møtes bankbokklubben for en kaffe og en bokprat. Av de bøkene vi har lest det siste året vil jeg spesielt trekke frem disse:</p><ul><li><a href=\"https://www.amazon.com/Culture-Code-Secrets-Highly-Successful-ebook/dp/B019CGXU68/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=&amp;sr=\">The Culture Code: The Secrets of Highly Successful Groups</a>, Daniel Coyle</li><li><a href=\"https://www.amazon.com/Loonshots-Nurture-Diseases-Transform-Industries-ebook/dp/B07D2BKVQR/ref=sr_1_1?crid=2AOW1GKBD4EM6&amp;keywords=loonshots&amp;qid=1561033496&amp;s=digital-text&amp;sprefix=loonsh%2Cdigital-text%2C208&amp;sr=1-1\">Loonshots: How to Nurture the Crazy Ideas That Win Wars, Cure Diseases, and Transform Industries</a>, Safi Bahcall</li><li><a href=\"https://www.amazon.com/Accelerate-Software-Performing-Technology-Organizations-ebook/dp/B07B9F83WM/ref=sr_1_1?crid=2VS6ZZG3NJA5J&amp;keywords=accelerate&amp;qid=1561033783&amp;s=digital-text&amp;sprefix=acce%2Cdigital-text%2C447&amp;sr=1-1\">Accelerate: The Science of Lean Software and DevOps: Building and Scaling High Performing Technology Organizations</a>, Nicole Forsgren, Jez Humble, Gene Kim</li></ul><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=f547e55aadd3\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/torsdag-er-den-nye-l%C3%B8rdagen-f547e55aadd3\">Torsdag er den nye lørdagen</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Stian Conradsen"}},{"node":{"title":"SpareBank 1 Utvikling skal prate på JavaZone","link":"https://medium.com/sparebank1-digital/sparebank-1-utvikling-skal-prate-p%C3%A5-javazone-470c3f92cc14?source=rss----e3c741b0efee---4","content":{"encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*5QxKYIMw17xKhFwstOgdbg.jpeg\" /><figcaption>JavaZone 2019</figcaption></figure><p>JavaZone er en av de store happeningene for oss i SpareBank 1 Utvikling. Dette er den største utviklerkonferansen i Nord-Europa, og er en fantastisk arena for å lære om alt det som foregår i industrien, fortelle om de spennende tingene vi jobber med hos oss, og ikke minst møte gamle kollegaer og treffe nye kjente.</p><p>Jobbingen med JavaZone standen og foredrag, foregår nesten hele året hos oss. I år holder vi fire foredrag, og vi har en stand med aktiviteter hvor software og hardware i stor grad er hjemmelaget. Vi skal ikke røpe for mye av detaljene, men vi kan vel si at de som kommer bortom standen vår, skal få noe å tenke på.</p><p>Her er foredragene vi skal holde på JavaZone i år:</p><h3>Torsdag er den nye lørdagen. Hvorfor bruker vi en dag i uken på fag?</h3><ul><li>Stian Conradsen</li><li>Onsdag 11. september, 1220, Rom 1</li><li>Tordentale 20 min</li></ul><h3>Monorepo med Git og Maven — hvordan lære gamle hunder nye triks</h3><ul><li>Anders Gjendem og Jonas Nordstrand</li><li>Onsdag 11. september, 1300, Rom 2</li><li>Presentasjon 45 min</li></ul><h3>Utvikleravdelingen må dø! Lenge leve utvikleravdelingen!</h3><ul><li>Jostein Emmerhoff og Vidar Moe</li><li>Onsdag 11. september 1540, Rom 4</li><li>Presentasjon 45 min</li></ul><h3>Hendelsesdrevet læring i SpareBank 1 — Erfaringer fra to år med post mortem</h3><ul><li>Kristoffer Berg</li><li>Torsdag 12. september 0900, Rom 1</li><li>Lyntale 10 min</li></ul><p>Vi har allerede <a href=\"https://medium.com/sparebank1-digital/hendelsedrevet-l%C3%A6ring-i-sparebank-1-ba50d96130c1\">delt av erfaringene våre fra to år med post mortem her på bloggen tidligere</a>. I løpet av august slipper vi bloggposter som deler mer av det vi kommer til å prate om på JavaZone i år.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*6QXZbtryvfcuyaUTzvqBhg.jpeg\" /><figcaption>Stemningsbilde fra JavaZone</figcaption></figure><p><a href=\"https://2019.javazone.no/program\">Sees i Oslo Spektrum fra 10. til 12. september. Dette blir gøy!</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=470c3f92cc14\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/sparebank-1-utvikling-skal-prate-p%C3%A5-javazone-470c3f92cc14\">SpareBank 1 Utvikling skal prate på JavaZone</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Vidar Moe"}},{"node":{"title":"Denne PSD2-datoen bør du kjenne til","link":"https://medium.com/sparebank1-digital/denne-psd2-datoen-b%C3%B8r-du-kjenne-til-1f397b470b76?source=rss----e3c741b0efee---4","content":{"encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*GMQTll7lRXPBAXAQiDcLCg.png\" /></figure><p>Mye er sagt om PSD2 (eller betalingtjenestedirektivet som vi så kortfattet sier på norsk), men det er spesielt to datoer som har vært viktige.</p><ul><li>14. mars (i Norge ble dette april til slutt): Dagen alle skulle kunne teste løsningene bankene vil tilby til tredjeparter med konsesjon som betalingsforetak.</li><li>14. september: Som tredje part skal du kunne hente ut informasjon fra banken på et vis som følger den tekniske spesifikasjonen for direktivet (den mye omtalte RTSen).</li></ul><p>Men ettersom tidslinjen for direktivet, og det som kalles “Søknad om fritak fra krav om reserveløsning for kontotilbyder (fallback)” har modnet i bankverdenen, har det dukket opp en ny dato. Denne er egentlig vel så viktig: 14. juni.</p><p>Og hva er “Søknad om fritak fra krav om reserveløsning ….”? Dette er en søknad som bankene må sende til Finanstilsynet der de forteller om PSD2-løsningen sin, hvordan den er og hvordan den er blitt brukt. Dette skal forsikre om at den er god nok til at tredje partene kan stole på den, og ikke påberope seg retten til å bruke en annen løsning.</p><p>Alternativet til en godkjent søknad kalles “fallback”. Med mindre banken ikke har en annen løsning implementert, vil tredje-part kunne bruke screen scraping som potensielt gir de tilgang til mer informasjon enn de har krav på under PSD2-direktivet.</p><p>En forutsetning for søknaden er at du har hatt trafikk på PSD2-løsningen din, i minst 3 måneder før 14. september. Og vipps så kom datoen 14.juni opp!</p><p>For resultatet av dette er jo at alle bankene vil måtte ha sin løsning i produksjon 14. juni, for å ha trafikk på den. Og det er da det hele <em>egentlig</em> begynner! For hvem vil vel være sist med å vise kontoer fra alle bankene i sine flater?</p><p>Vi står nå klare med våre grensesnitt — og ønsker tredjeparter varmt velkommen. Frem til midten av juni gjør vi manuell innrullering av tredje parter. Så om du ønsker tilgang til våre grensesnitt er det bare å ta kontakt med meg på kristine.ursfjord@sparebank1.no.</p><p>Se gjerne på portalen til en av våre banker for informasjon om tilgang f.eks. <a href=\"https://psd2.sparebanken.no/portal-sandbox/enrollment\">her</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=1f397b470b76\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/denne-psd2-datoen-b%C3%B8r-du-kjenne-til-1f397b470b76\">Denne PSD2-datoen bør du kjenne til</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Kristine Ursfjord"}},{"node":{"title":"Datadrevet og kundeorientert utvikling, sa du?","link":"https://medium.com/sparebank1-digital/datadrevet-og-kundeorientert-utvikling-sa-du-9a18e89ba416?source=rss----e3c741b0efee---4","content":{"encoded":"<p>Å ha en mer <em>datadrevet og kundeorientert</em> tilnærming til utvikling av digitale tjenester og produkter er stadig viktigere for å henge med i en tøff konkurransesituasjon. Dette er noe som gjerne faller seg naturlig for startups og er en tilnærming som de globale teknologi-gigantene er skremmende gode på. Men hvorfor kan det se ut om dette er spesielt krevende å bli god på for etablerte organisasjoner som vår egen? Og hva legger vi egentlig i <em>datadrevet og kundeorientert</em> utvikling?</p><h3>Bort med antagelsene</h3><p>Det er her snakk om en tilnærming til digital produkt- og tjenesteutvikling hvor man er drevet av innsikt — og ikke antagelser. Eric Rise gjorde denne tilnærmingen kjent gjennom boken The Lean Startup som ble utgitt i 2011 [2]. Tilnærmingen omtales både som eksperimentdrevet utvikling og hyptesedrevet utvikling, samt at UX miljøet har trykket den til sitt bryst som en del av begrepet Lean UX [8]. Videre i denne artikkelen vil jeg omtale denne tilnærmingen som <em>datadrevet og kundeorientert utvikling, </em>som er mer beskrivende for hva vi ønsker å få til.</p><p>Kort fortalt så handler det om å gjøre innsiktsarbeid og eksperimenter mot sluttkunde som en del av oppgaveløsningen. Dette gjøres for å redusere antagelser man tar både før og underveis i utviklingen. Læringen man tilegner seg ved analysen av, og involveringen fra, kunde skal brukes aktivt til å styre valgene man fortløpende tar.</p><p>Arbeidet med å realisere noe gjøres veldig forenklet ved hyppige iterasjoner der man <em>bygger</em> noe, man <em>måler</em> hvordan det går og man bruker <em>læringen</em> i videre arbeid med nye iterasjoner. Dette til forskjell fra hva mange tidligere har gjort — <em>bygge </em>masse for så å <em>håpe på det beste</em>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*H8PMJLcRoULjlBz0BN72ug.png\" /><figcaption>Vi må gå bort fra en tilnærming hvor man bygger masse basert på antagelser for så å håpe på at noen har lyst til å bruke produktet eller tjenesten</figcaption></figure><p>Målet med å jobbe på denne måten er at innsikt — og ikke antagelser — skal drive utviklingen.</p><h4>Eksempler på eksperimentering</h4><p>Når et team har denne tilnærmingen har de typisk en veldig klar visjon eller retning for hvor de skal, men erkjenner at de kun har antagelser om hvordan de skal komme seg dit. Teamet setter derfor typisk opp en hypotese og utfordrer seg selv på hvordan de, med minst mulig ressurser, kan få innsikt som sier noe om denne antagelsen er riktig eller gal. Det er bare kreativiteten til teamet som begrenser hvilke type eksperimenter de kan gjøre. Her er noen eksempler vi har sett i noen av våre team:</p><ul><li><em>Fiktiv tjeneste / Fake doors</em>: Man lanserer en tjeneste eller funksjonalitet uten at den er (i nærheten av) ferdig. Dette for å tidlig kunne få feedback på hvordan brukere vil ta i bruk tjenesten eller funksjonaliteten. Det som i dag har blitt <a href=\"http://www.spleis.no\">spleis.no</a> var i starten et lite innovasjonsteam som eksperimenterte med en uferdig tjeneste under fiktivt navn og merkevare.</li><li><em>A/B testing</em>: Man presenterer flere ulike varianter av en endring til ulike kundegrupper og måler hvordan de ulike alternativene presterer.</li><li><em>Gradvis utrulling</em>: Man starter i det små med å rulle ut endring til en liten del av brukermassen for så å analysere og gjøre forløpende endringer før man slipper på flere.</li><li><em>Fake it til you make it I</em>: Lansere en tjeneste tidlig, hvor kunden opplever det som en komplett tjenesten, men som i realiteten krever mye manuell oppfølging i bakkant.</li><li><em>Fake it til you make it II: </em>Et fint eksempel er også når et team hos oss skulle lage e-post notifikasjon/kvittering til kundene. Det som for kunde så ut som en automatisk generert kvittering, var i realiteten manuelt laget på enklest mulig måte i ulike varianter til ulike kundegrupper. Man brukte først utviklingstid på å implementere den varianten man visste hadde best effekt (mtp aksjoner kunden gjorde etter å ha mottatt kvitteringen).</li><li><em>Spør kunden</em>: I arbeidet med en ny tjeneste eller ny funksjonalitet er man smart med å jobbe inkrementelt hvor man gir sluttkunde mulighet til å gi feedback mellom iterasjonene.</li><li><em>Mål adferd</em>: Dagens team har en helt annen mulighet enn tidligere til å bruke data og målinger til å lære om kundenes adferd. Dette brukes aktivt i arbeidet med å stadig og stegvis forbedre løsningene våre.</li></ul><h4><strong>Hvorfor er dette viktig?</strong></h4><p>Selv om vi ofte tror vi vet det — så har vi sjelden på forhånd nok innsikt i hvilke problemer kunden ønsker at vi løser og hvordan vi bør løse de. Dette har resultert i at det opp igjennom årene har vært investert utrolig mye penger i antagelser og gjetting. Dette har igjen ført til utvikling av produkter og tjenester som (I) ingen kunder vil bruke, (II) kundene er misfornøyd med eller (III) som må lages helt på nytt.</p><p>Ved både å ha langt flere personer i teamene med interesse og fagkunnskap om UX/kundeinnsikt, samt at hele teamet bruker data og innsikt mer aktivt i utviklingen vil vi øke sannsynligheten for at vi lager produkter og tjenester som kundene faktisk vil ha.</p><h4><strong>Når skal man benytte denne tilnærmingen?</strong></h4><p>Vi startet med denne tilnærmingen på noen utvalgte prosjekter som gjerne kan kalles interne startups. Dette var grupper som kunne jobbe relativt isolert og gjerne var uavhengig av øvrig organisasjon når det kommer til arkitektur, teknologivalg, løsninger og andre team. De senere årene har vi tatt inspirasjon og læring fra disse interne startups og forsøkt å ha samme tilnærming på noen av de mer etablerte løsningene og teamene våre. Dette har ført til at vi må ha et mer bevisst forhold til når vi bruke hvilken tilnærming.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*BpdSPHqvUIsJ1t0MUqXkTA.png\" /><figcaption>Teamene våre må kunne jobbe i ulike modus avhengig av hvilke problem de skal løse</figcaption></figure><p>Illustrasjonen over viser litt grovt sett hvilke ulike modus teamene våre må kunne jobbe på avhengig av hvordan problemet de skal løse.</p><ol><li>Tradisjonell utvikling: Vi gjør lite av dette, men i enkelte tilfeller har vi sterke avhengigheter til store leveranser fra leverandører eller er avhengig av store datamigreringer for å kunne lansere noe. Det jobbes gjerne smidig internt i utviklingsfasen, men i stort er leveransen vannfall.</li><li>Smidig utvikling er tilnærmingen de aller fleste teamene våre jobber i til vanlig. Teamene våre har stor frihet til hvordan de velger å jobbe, men de fleste teamene ender opp med en KANBAN variant med enkelte elementer fra Scrum. I denne modusen vet vi gjerne hva vi skal lage.</li><li>Hypotesedrevet utvikling: Er tilnærmingen som er beskrevet i denne artikkelen. I denne modusen skal vi både finne ut <em>hva</em> vi skal lage — og <em>hvordan</em> vi skal lage det.</li></ol><p>I vurderingen om hvordan tilnærming man kan bruke er det god hjelp i modeller som <a href=\"https://en.wikipedia.org/wiki/Cynefin_framework\">Cynefin</a> (uttalles Ki-NEW-in). Modellen er utarbeidet av <a href=\"https://twitter.com/snowded\">Dave Snowden</a> beskriver ulike nivåer av kompleksitet og sier at hvilken problemløsningsmetode vi bør velge, avhenger av problemets kompleksitet. <a href=\"https://medium.com/@gamsjo\">Geir Amsjø</a> har skrevet en fin artikkel om rammeverket <a href=\"http://scrummaster.no/2014/cynefin-for-beslutningsstotte/\">her</a>.</p><p>Videre i artikkelen vil vi fokusere på hvordan vi har startet å jobbe mot en mer datadrevet og kundeorientert utvikling. En tidlig erfaring var at det ikke er teamene vi må starte med, heller med rammebetingelsene til teamene.</p><h4><strong>Start med rammebetingelsene til teamene</strong></h4><p>Selv om det kreves både modenhet og kompetanse i teamene for å jobbe etter denne tilnærmingen er vår erfaring at det viktigste er hvilke rammebetingelser som blir gitt til teamene. I arbeidet med de ulike teamene hos SpareBank 1 som helt eller delvis jobber etter denne tilnærmingen er det to ting som dukker opp som viktige for å lykkes:</p><ol><li><strong>Outcome orientering</strong>: Når vi som organisasjon klarer å gi teamene målsetninger og retning — og ikke konkrete bestillinger.</li><li><strong>Hastighet</strong>: Når vi som organisasjon klarer å gi teamene den nødvendige hastigheten de trenger for å kunne gjøre eksperimentering som en del av oppgaveløsningen.</li></ol><h4><strong>Krever store endringer på organisasjonen</strong></h4><p>Som tidligere nevnt er denne tilnærmingen krevende å rigge seg for når man som organisasjon gjerne sitter på både teknisk og organisatorisk historikk. Litt av årsaken til dette er at ulike deler av organisasjonen må endre seg for at man skal kunne få teamene til å agere på denne måten. Ledelse og “forretningssiden” til teamene må endre tankesett for å oppnå outcome-orientering og IT-delen av organisasjonen må endre seg ganske dramatisk for å kunne gi den nødvendige hastigheten til teamene.</p><h3><strong>Hvordan bli outcome-orientert?</strong></h3><p>Det hele starter med at man har kryssfunksjonelle og autonome team. <em>Kryssfunksjonelle</em> ved at man har de fagdisiplinene tilstede i teamet som trengs for å løse det aktuelle problemet, og <em>autonomt</em> ved at gruppen faktisk har mulighet til å løse problemet uten for mye avhengigheter. Diskusjonene om hvor autonomt et team skal være og om det i det hele tatt er mulig at et team er helt autonomt i en kompleks organisasjon er ikke så interessante synes jeg. Det viktige er sette sammen en gruppe med mennesker som sammen kan løse problemet — og fokusere på at denne gruppen har:</p><ul><li>minst mulig avhengigheter til andre løsninger/team</li><li>minst mulig behov for å løpe i organisasjonen etter avklaringer</li><li>minst mulig behov for å spørre om lov utenfor teamet</li></ul><p>Når man har et velfungerende kryssfunksjonelt team er det forlokkende for organisasjonen å henvende seg til dette teamet å gi de beskjed om akkurat hva de skal lage. Lag denne tjenesten, gjør denne endringen og så videre. På denne måten utnytter du imidlertid ikke teamet særlig bra. Bruk teamene til det de er gode på — nemlig problemløsning.</p><p>Organisasjonen bør heller sikre at man kan kommunisere en tydelig retning til teamene og følge opp team på målsetninger og hva de faktisk oppnår. Når man er tydelig på målsetninger ovenfor teamene gir man med andre ord teamene et problem å løse, snarere enn ferdig løsninger.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1020/1*s5kv_uqcQRq2jDdxOopMZg.png\" /><figcaption>Illustrasjon: Hanne Wetland/Netlife fra presentasjonen “Hva er problemet ditt” av Jostein Magnussen/Netlife</figcaption></figure><p>Kryssfunksjonelle og autonome team som man måler på outcome har imidlertid med seg noen utfordringer som man må løse:</p><ol><li>Hvordan hindre anarki?</li><li>Hvordan endre tankesettet til ledere og det vi tradisjonelt har kalt “forretningsiden”.</li></ol><h4><strong>Hvordan hindre anarki?</strong></h4><p>I en organisering med kryssfunksjonelle og autonome team sikter man gjerne på en nettverksorganisering snarere enn en hierarkisk oppbygning av organisasjonen [12]. Om mer av problemløsningen skjer i teamene vil tydelig retning og strukturert arbeid med målsetninger bli viktig. Vi har innsett at vi av den grunn må bli mer strukturert i arbeidet med målsetninger og retning ovenfor teamet — noe vi for tiden jobber mye med i SpareBank 1 Utvikling.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/proxy/1*3PQHnnpNKsVAJhNts_GhPQ.png\" /><figcaption>Henrik Kniberg har i sitt arbeid hos Spotify jobbet med hvordan man balanserer autonomi og alignment og kommet opp med begrepet <em>alligned autonomi </em>om noe man bør søke å oppnå. Henrik Kniberg / Spotify — Aligned Autonomy</figcaption></figure><p>Henrik Kniberg har i sitt arbeid hos Spotify jobbet med hvordan man balanserer autonomi og alignment og har gjennom dette kommet opp med begrepet <em>alligned autonomi </em>om noe man bør søke å oppnå.</p><p>Illustrasjonen og <a href=\"https://www.youtube.com/watch?v=_qIh2sYXcQc\">denne</a> videoen beskriver dette godt.</p><h4><strong>Hvordan endre tankesettet til ledere og “forretningsside”?</strong></h4><p>Det høres kanskje lett ut å endre tilnærming i organisasjonen slik at man måler teamene på hva de oppnår og ikke hva de gjør. Men i store organisasjoner har man kanskje både personer, roller og hele avdelinger som tradisjonelt har jobbet med <em>hva </em>som skal gjøres. I en organisasjon med team man ønsker agerer mer datadrevet og kundeorientert, må mye av <em>hva </em>som skal gjøres overlates til teamene. Personer, roller og avdelinger som tidligere har gjort dette må jobbe som en del av teamene eller jobbe på en annen måte enn tidligere. Vår erfaring er at dette gjøres best ved starte begrenset, ved å velge ut et prosjekt, et produkt eller et område hvor man blir enig om at man skal jobbe på en litt annen måte enn tidligere.</p><h3>Hvordan gi teamene nødvendig hastighet?</h3><p>Om eksperimentering mot sluttkunde skal være en del av oppgaveløsningen til teamene er det en forutsetning at teamene har hastighet. SpareBank 1 Utvikling har jobbet med å få opp hastigheten på teamene i mange år nå, fra å ha kvartalsvise releaser av totaliteten, til nå hvor hvert enkelt team i større grad kan styre sin egen leveransehyppighet av applikasjonene innenfor sitt ansvarsområde.</p><p>Da vi gjorde en brainstorming rundt hvilke tiltak vi har gjort de siste årene for å øke hastigheten vår var det veldig lett å komme opp med en lang liste av tiltak og årsaker. Vi har forsøkt å kategorisere endringene vi har gjort og skal liste opp disse samt si noe om rekkefølgen på endringene vi har gjort.</p><p>Kategorier av endringer er: <br>- Arkitektur<br>- Organisering<br>- Prosess<br>- Mennesker</p><h4><strong>Endringer på vår arkitektur for å sikre hastighet</strong></h4><p>Vi starter i 2012 en reise hvor vi gikk fra en monolittisk arkitektur over til en mer mikrotjenesteorientert arkitektur. Dette er en reise vi fortsatt er på, og målet har vært det samme hele tiden; løse koblinger. Spørsmålet vi hele tiden har stilt er hvordan arkitekturen vår kan støtte oss i arbeidet med å organisere oss i små grupper som jobber med deler av våre løsninger uten å være påvirket av de andre.</p><p>Vi ønsker team som ikke er satt sammen som et resultat av tekniske løsninger, men heller er satt sammen for å levere på et forretningsmessig eller kundeorientert domene.</p><h4><strong>Endringer på vår organisering for å sikre hastighet</strong></h4><p>Etter at vi fikk en mer fleksibel arkitektur hvor det var mulig å sette grupper av mennesker til å ta ansvar for ulike deler av løsningene våre, ga det oss noen spennende muligheter når det kommer til å jobbe med organisering. Dette arbeidet var sterkt inspirert av Lean og Lean verdikjedeorientering.</p><ul><li>Hva er det vi egentlig leverer?</li><li>Hva er våre hovedprosesser og hva er støtteprosesser?</li><li>Hvordan kan vi optimalisere for hovedprosessene våre og sørge for at vi er mest mulig effektive fra en idè oppstår til den gir verdi til sluttkunde?</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/281/1*IT8kKZ6VzmeR7HvgbkWNCQ.png\" /></figure><p>Vi så tidlig at en av de hyppigste årsakene til problemer og tregheter i organisasjonen vår var overleveringer av ulike sorter. De meste smertefulle overleveringene var:</p><ul><li>Overleveringer mellom fagdisiplinene design, utvikling og test</li><li>Overleveringer mellom utvikling og drift</li><li>Overleveringer mellom prosjekt og forvaltning</li></ul><p>Det har tatt tid, men for å løse opp i disse problemene har det vært helt naturlig for oss å gjøre en overgang til (I) kryssfunksjonelle team for å løse opp i overleveringer mellom fagdisipliner, (II) fokus på DevOps-praksiser for å løse opp i overleveringer mellom Utvikling og Drift, samt (III) en overgang fra prosjektorientering til produkutviklings-fokus for å fjerne overleveringer mellom prosjekt og forvaltning.</p><h4><strong>Endringer på våre prosesser for å sikre hastighet</strong></h4><p>En nøkkel for oss har vært å innføre stadig <em>færre</em> sentrale prosesser og retningslinjer for hvordan teamene skal jobbe. Med en arkitektur og organisering som gjør at teamene kan bli mer selvstendige, kan det også være mer opp til det enkelte team å påvirke hvordan de selv jobber mest mulig effektivt.</p><p>Med for mye sentralstyrte prosesser er vi redd for at vi hindrer mye av den kontinuerlige forbedringen vi er avhengig av for å stadig bli bedre. Vi trenger både personer og team som tør å utfordre hvordan vi jobber og ønsker å bidra til at vi stadig tar nye steg i å bli mer effektive.</p><p>Her ligger det selvsagt en utfordring i både å fange og å dele erfaringer fra de enkelte teamene slik at vi sammen løfter oss som organisasjon. Vegard Kolbjørnsrud har noen gode poenger i sitt foredrag “<a href=\"https://www.bi.no/forskning/business-review/articles/2019/02/hvordan-designe-smidige-og-smarte-organisasjoner/\">Designe smidige og smarte organisasjoner</a>” hvor han påpeker at en organisering i smidige team er bra sted for læring, men at hukommelsen er dårlig.</p><h4><strong>Endringer på hvordan behandler mennesker for å sikre hastighet</strong></h4><p>Vi kan gjøre hvilke endringer vi vil på arkitektur, organisering og prosess, men uten at vi har motiverte mennesker som virkelig vil gjøre en innsats for å få dette til å fungere — hjelper det ingen ting. Å være et godt sted som folk vil jobbe starter med at organisasjonen, og særlig ledere, har en grunnleggende tro på at ansatte kommer på jobb for å bidra, lære og levere verdi. Starter organisasjonen med å ha tro på folk, får man ikke ansatte som trenger å gjetes, men får ansatte og team som tenker selv og som utfordrer! Det er bra det!</p><h3>Hva har inspirert oss?</h3><p>Om du har lyst til å dykke dypere i disse temaene har jeg her listet et utvalg bøker og noen foredrag som har vært spesielt inspirerende i arbeidet med å lage en stadig bedre utviklingsorganisasjon.</p><h4>Bøker</h4><ol><li>The Toyota Way (Jeffrey K. Liker)</li><li>The Lean Startup (Eric Rise)</li><li>DevOps Handbook (Gene Kim, Patrick Debois, John Willis, Jez Humble)</li><li>Accelerate (Nicole Forsgren, Jez Humble, Gene Kim)</li><li>This is lean (Par Ahlstrom, Niklas Modig)</li><li>The Age of Agile (Stephen Denning)</li><li>The Culture Code (Daniel Coyle)</li><li>Lean UX (Jeff Gothelf, Josh Seiden)</li></ol><h4>Foredrag</h4><p>9. Henrik Kniberg, <a href=\"https://vimeo.com/110550974\">Spotify Engineering Culture</a> (Smidigkonferansen 2014)</p><p>10. Jon Kåre Stene, <a href=\"https://vimeo.com/78631283\">End of Big, hva nå?</a> (Smidigkonferansen 2013)</p><p>11. Mary Poppendiek, How do teams know what to do (SpareBank 1 2017)</p><h4>Andre kilder</h4><p>12. <a href=\"https://www.mckinsey.com/business-functions/organization/our-insights/the-five-trademarks-of-agile-organizations\">The fine trademarks of agile organizations</a></p><p>13. <a href=\"https://agilemanifesto.org/\">The agile manifesto</a></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=9a18e89ba416\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/datadrevet-og-kundeorientert-utvikling-sa-du-9a18e89ba416\">Datadrevet og kundeorientert utvikling, sa du?</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Jostein Emmerhoff"}},{"node":{"title":"Beretninger om en varslet katastrofe","link":"https://medium.com/sparebank1-digital/beretninger-om-en-varslet-katastrofe-f310ad50dbeb?source=rss----e3c741b0efee---4","content":{"encoded":"<p>“Den dagen de skulle drepe ham, stod Santiago Nasar opp klokken 5.30 om morgenen for å vente på båten som biskopen kom med. Han hadde drømt at han vandret gjennom en kjempefikenskog hvor det falt bløtt duskregn, og et øyeblikk var han lykkelig …”</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/183/1*8Em_1Z5BHAnUZvlKTx0cXQ.png\" /></figure><p>Tittelen og formen på denne posten er inspirert av Gabriel Garcia Marquezs roman “Beretninger om et varslet mord”. Et av de sentrale temaene i denne romanen er mordet på Santiago Nasar, som var forutsett og tilsynelatende hadde hele samfunnets velsignelse, mens det i virkeligheten skjer uten at noen egentlig ville det. Dette er et forsøk på en alternativ last- og ytelsesrapport, for helt ærlig hvor gøy er det egentlig å skrive eller lese slike rapporter?</p><p>Vi hadde kjørt ml-appen vår i produksjon en liten stund, og alt hadde sett bra ut. Vi var egentlig ganske fornøyde, men de siste dagene hadde vi sett at noe var på gang, minnebruken gjorde noen hopp med jevne mellomrom. Det ble aldri frigitt noe.</p><p>Minne er en begrenset ressurs og denne utviklingen er ikke bærekraftig. Vi kommer til å gå tom for minne. I oppsettet vårt er det slik at når grensen for tildelt minne nås vil applikasjonen drepes. Heldigvis skal vi ha introdusert et “Jesus”-gen, så de skal gjenoppstå av seg selv. Dette har vi ikke fått testet i produksjon, så da denne situasjonen oppstod hadde vi et perfekt utgangspunkt for å få verifisert at alle deler fungerte som forutsatt.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1013/1*Z6gLJIrN09PA93pMvwgJaA.png\" /></figure><p>Plutselig må det ha skjedd noe dramatisk, to av instansene får en ustoppelig apetitt på minne. Kan ikke være lenge til nå. Vi finner frem kalkulatoren og regner oss frem til at den første instansen vil eksplodere ca kl 8 fredag kveld. Vi kjøper inn popcorn og sitter klare.</p><p>Men, vi har tabbet oss ut. I overvåkningsgrafene våre plotter vi minnebruken i GB, mens tildelt minne er GiB. Katastrofen er utsatt! Her er første læringspunkt, sørg for å rapportere i samme skala som man opererer. Spiste popcornet likevel.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/507/1*lUVvno3fs63rh5y1Ylzs1g.png\" /></figure><p>Katastrofen er uungåelig, og klokken 23 lørdag kveld skjer det. Og ingen får det egentlig med seg. Før på mandag. Og da er jo alt bare fryd og gammen. Appen har gjenoppstått som den skulle og den spiser minne som tidligere.</p><p>Løsningen er verifisert, trafikken ble rutet til en av de andre instansene og kundene merket ingenting.</p><p>Det er et kjent ordtak som sier at Python tar det minne den kan få tak i, og frigir bare til seg selv. Vi forventer altså en svakt økende minnebruk. Dette er greit å ha med seg og betyr at du ikke nødvendigvis har gjort noe feil i applikasjonen din.</p><p>Vi hadde benyttet biblioteket functools til å håndtere trådene i applikasjonen. Våre undersøkelser tydet på at problemet lå i hvordan vi brukte dette biblioteket. Vi byttet til standard Python trådhåndtering og da ble det rimelig klart hvor problemet var:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*wI5AciLZjEz1pFRcUfquwQ.png\" /><figcaption>Minnebruk ved ulike trådhåndteringsbiblioteker</figcaption></figure><p>For å se hvordan forskjellige modellstørrelser påvirker minne- og CPU-bruk trente vi først opp modeller på forskjellige mengder treningsdata. Modellene ble brukt med et oppsett som skulle simulere produksjon.</p><p>Maksimalt påtrykk som er målt i produksjon er 600 request/minutt med et snitt på 80 elementer/request. På dette grunnlaget ble det generert en statisk request med 80 elementer som ble kjørt i to tråder. Request-delay ble satt til 200 ms, som gir 2x5 request/sekund = 600 req/min totalt.</p><p>Tallene i tabellen under ble plukket ut fra <strong>top</strong> etter at tallene hadde stabilisert seg etter et par kjøringer.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/641/1*3NE5zp49qN1UDZQTYPbleA.png\" /></figure><p><strong>Her ser vi flere ting:</strong></p><ul><li>Ved bruk av veldig runde tall — modellstørrelsen dobles for hver 4x økning av treningssettet</li><li>Minneforbruk korrelerer bra med størrelsen på modellene. Den er ikke helt lineær, stigningen er avtagende (innslag av logaritme).</li><li>CPU-bruk øker ikke veldig mye selv om modellstørrelsen øker betraktelig.</li><li>Responstid ligger på snitt 3ms siden CPU holder seg godt under 100%</li></ul><p>Alt dette hadde vi gjort før instansen gikk i luften, vi hadde også en ny versjon klar som fikset problemet. Kjøremiljøet vårt er Kubernetes/OpenShift og i løpet av prosessen endte vi også opp med å gjøre endringer i hvordan minne og CPU tildeles.</p><p>Aller helst skulle vi sett at problemet ikke hadde oppstått. Når det først skjedde har det, at vi lot katastrofen inntreffe, gjort at vi totalt sett har en bedre løsning nå enn om vi hadde rettet feilen med en gang vi oppdaget den.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=f310ad50dbeb\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/beretninger-om-en-varslet-katastrofe-f310ad50dbeb\">Beretninger om en varslet katastrofe</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Jan Erik Modal"}},{"node":{"title":"Fra ti om året til ti om dagen","link":"https://medium.com/sparebank1-digital/fra-ti-om-%C3%A5ret-til-ti-om-dagen-70a703dcf178?source=rss----e3c741b0efee---4","content":{"encoded":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*3Sxsb5u8oGE16sGPlVVKGQ.jpeg\" /><figcaption>Bilde fra <a href=\"https://unsplash.com/photos/9cCeS9Sg6nU?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">chuttersnap</a> på <a href=\"https://unsplash.com/search/photos/containers?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a></figcaption></figure><p>Det er bare få år siden vi hadde ti nettbankreleaser i året. Nå har vi innimellom ti releaser på forskjellige deler av nett- og mobilbanken på samme dag.</p><p>Har du tenkt på at evnen til å endre raskt, er en forutsetning for å kunne drive med datadrevet utvikling?</p><p>@<a href=\"https://medium.com/@somaiah\">Somaiah Nymoen Kumbera</a> har skrevet en bloggpost om reisen vi er på <a href=\"https://medium.com/capgemini-norway/our-devops-transition-at-sparebank-1-45dadd7e2c0d\">her</a>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=70a703dcf178\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/fra-ti-om-%C3%A5ret-til-ti-om-dagen-70a703dcf178\">Fra ti om året til ti om dagen</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Vidar Moe"}},{"node":{"title":"Hendelsedrevet læring i SpareBank 1","link":"https://medium.com/sparebank1-digital/hendelsedrevet-l%C3%A6ring-i-sparebank-1-ba50d96130c1?source=rss----e3c741b0efee---4","content":{"encoded":"<h4><strong>Erfaringer fra to år med post mortem</strong></h4><p>Du har trolig kjent på smerten som oppstår når noe du jobber med, og har ansvaret for, går galt. Det gjør vondt, og instinktet er gjerne å legge det uheldige bak seg så raskt og stille som mulig. Samtidig er erfaringer tilknyttet feil og uheldige hendelser en gullgruve for å forbedre måten det jobbes på. Gjennom dette kan erfaringene være med å forhindre at feil inntreffer på nytt.</p><p>SpareBank 1 jobber med pengene til folk, og løsningene våre regnes som kritisk infrastruktur i Norge. Ved hendelser av en viss karakter og omfang skal det derfor utarbeides en rapport til Finanstilsynet. Dette er det gode rutiner for i SpareBank 1, og arbeidet ble tidligere håndtert av en fast rolle i utviklingsteamene.</p><p>Vi ønsket å dra mer nytte av potensialet knyttet til læring ved slike hendelser. Spesielt nysgjerrige var vi på hvordan organisasjonen bedre kunne legge til rette for læring i etterkant av hendelser, på en trygg og positiv måte for alle involverte. Bakgrunnen var betydelig varians i organisasjonen i forbindelse med involvering, analyse og evne til å gjennomføre tiltak for forbedring, tilknyttet feil og uønskede hendelser.</p><h4><strong>Test av post mortem</strong></h4><p>Mot slutten av 2016 bestemte vi oss derfor for å teste ut konseptet <a href=\"https://www.pagerduty.com/resources/learn/post-mortem-incident-report/\"><em>post mortem</em></a> på feil og hendelser vi opplevde i produksjon. Kort fortalt er en post mortem en prosess der alle involverte går gjennom hendelsesforløpet sammen, for å etablere en tidslinje for hva som skjedde når, forstå hva som gikk galt, og identifisere rotårsaker til hvorfor dette inntraff. Med utgangspunkt i denne innsikten diskuterer man så hvilke tiltak som skal testes ut for å løse problemet. Arbeidet skjer innenfor en ramme der man <em>ikke</em> snakker om hvem som har skylden for det som har skjedd. Psykologisk trygghet er en viktig forutsetning for å lykkes med dette. En vellykket post mortem vil resultere i læring innenfor en positiv ramme, på bakgrunn av at noe ikke gikk som man ønsket. Den setter oss i stand til å identifisere relevante tiltak for forbedring med utgangspunkt i reelle rotårsaker, og over tid styrkes kvaliteten på det vi leverer. PagerDuty beskriver hendelse-post mortem nærmere <a href=\"https://www.pagerduty.com/resources/learn/post-mortem-incident-report/\">her</a>.</p><h4><strong>Kultur er viktig</strong></h4><p>Hvordan organisasjonen reagerer på en hendelse, betyr mye for hvilke rammer man jobber innenfor. I boken <a href=\"https://www.amazon.com/Accelerate-Software-Performing-Technology-Organizations/dp/1942788339\">Accelerate</a> omtales Dr. Ron Westrum sin “typology of organizational culture”, som beskriver tre typer organisasjoner (Westrum 2014):</p><ul><li>Pathological organisations are characterized by large amounts of fear and threat. People often hoard information or withhold it for political reasons, or distort it to make themselves look better.</li><li>Bureaucratic organisations protect departments. Those in the department want to maintain their “turf,” insist on their own rules, and generally do things by the book — their book.</li><li>Generative organisations focus on the mission. How do we accomplish our goal? Everything is subordinated to good performance, to doing what we are supposed to do.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/894/1*kGCJhifSsa0PVlXxlvi9MQ.png\" /><figcaption>Westrums Topology of Organizational Culture, hentet fra boken <a href=\"https://www.amazon.com/Accelerate-Software-Performing-Technology-Organizations/dp/1942788339\">“Accelerate: The Science of Lean Software and DevOps: Building and Scaling High Performing Technology Organizations”</a>.</figcaption></figure><p>Å være klar over hvor man befinner seg i denne modellen er nyttig for å forstå forventningene folk tar med seg inn i en post mortem. Vil man fritt dele informasjon med lave skuldre eller vil man bekymre seg for eventuelle konsekvenser av det som blir sagt? Funnene fra en fem år lang studie utført av Google, der man undersøkte hva som skapte de beste teamene, støtter opp om dette. I artikkelen <a href=\"https://www.nytimes.com/2016/02/28/magazine/what-google-learned-from-its-quest-to-build-the-perfect-team.html\">“What Google Learned From Its Quest to Build the Perfect Team”</a> i New York Times Magazine fra februar 2016 skriver Charles Duhigg: “Google’s data indicated that psychological safety, more than anything else, was critical to making a team work.”</p><h4><strong>Post mortem som standard</strong></h4><p>På bakgrunn av positive erfaringer fra forsøksperioden standardiserte vi fra begynnelsen av 2017 på post mortem for alle hendelser i produksjon av en viss karakter. For å gjøre det enkelt å komme i gang, ble retningslinjer og maler tilrettelagt og gjort lett tilgjengelig for utviklingsteamene. I skrivende stund er det 19 team i operasjonen. Videre var personer med erfaring klare til å bistå teamene ved oppstarten. De passet særlig på at kjørereglene for post mortem var godt kjent og ble etterlevd.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/753/1*aX8zGc9p3uGwI_4X7E9FIA.jpeg\" /></figure><p>Standardiseringen sikret prioritet for gjennomføring av post mortem. En fellesarena ble dermed skapt for dialog, refleksjon og læring, på tvers av organisasjonen. Det ble raskt etablerte et mønster der en feilsituasjon først blir håndtert med fullt fokus (som tidligere). Kort tid etter gjennomføres post mortem mens hendelsen er relativt fersk.</p><h4><strong>Erfaringer med post mortem</strong></h4><p>Per i dag er det gjennomført 37 post mortems. Tabellen under viser summen av post mortems gjennomført i 2017 og 2018, fordelt på årets måneder. Her skiller juli måned skiller seg ut, med null post mortem. Trolig henger dette sammen med færre endringer under sommerperioden. November var måneden med flest post mortems.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/560/1*Jw-s_Fhe_QCTyxfjhVU4dw.png\" /><figcaption>Summen av post mortems gjennomført i 2017 og 2018, fordelt på måneder.</figcaption></figure><p>Første gang man utfører en post mortem oppleves det gjerne uvant, og det kan være nyttig med to personer som samarbeider om å fasilitere gjennomføringen. Vi erfarte også at det var lurt å starte med en gjennomgang av formålet og kjørereglene for arbeidet som skulle finne sted. Videre var støtte fra noen med erfaring gunstig, særlig for å sikre fokus på skyldfri dialog. Med erfaring blir det mer rutinepreget å gjennomføre en post mortem. Dette har resultert i god flyt og begrenset tidsbruk.</p><p>I tillegg har det vist seg viktig å passe ekstra på at alle involverte ved en hendelse inviteres og oppfordres til å delta. Vi har sett stor verdi av å komme sammen utenfor gruppene man jobber i det daglige, som utvikling, drift og kundestøtte. Å samles slik “på tvers av siloer” fører til at en større del av totalbildet ved hendelser fremkommer, samtidig som relasjoner og tillit bygges mellom personer som ellers sjelden møtes.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/275/1*kaf4O_-qB4iuUd-DHruqXA.jpeg\" /></figure><p>Som del av en post mortem la vi etterhvert til en vurdering av egnede arenaer for deling av innsikt, som faggrupper, demo-sesjoner, tavlemøter mm. Dette har styrket vår delingskultur, og økt fokus på deling av læring med resten av organisasjonen.</p><p>En annen endring som har funnet sted, er at mye av arbeidet med å ta frem rapporter til Finanstilsynet ble flyttet fra en fast rolle og over til teamet. Erfaring med post mortem bidro til å forberede teamene på denne endringen.</p><p>Post mortem har blitt del av verktøykassen for å styrke vår evne til å lære, og brukes nå tidvis mer enn opprinnelig tiltenkt. Et eksempel på dette er teamet som bestemte seg for at i deres arbeid for å sikre rett kvalitet, skulle <em>alle</em> feil, som oppstod i en forhåndsdefinert periode, resultere i post mortem. Et annet team benyttet post mortem for å jobbe med prosessforbedring i en situasjon der det tok lang tid å få påbegynt arbeid satt i produksjon, uten at dette var relatert til noen spesifikk hendelse.</p><h4><strong>Flere mulige bruksområder</strong></h4><p>Det har så langt ikke vært like naturlig for oss å bruke post mortem for å regulere kontraktfestede leverandørforhold utenfor organisasjonen. Kanskje ligger det noe spennende i vente her, der post mortem med åpen dialog mellom gode samarbeidspartnere kan videreutvikle et fundament der tilliten mellom partene allerede er høy? Vi kan trolig også dra nytte av å legge bedre til rette for søk og analyse på totalen av erfaringer fra en voksende post mortem-base. Et annet område det har vært knyttet en del interesse til, er å benytte post mortem for å styrke læringsevnen på ting som går bra, og dermed bygge videre på gode prestasjoner gjennom positiv forsterkning.</p><h4><strong>Oppsummering</strong></h4><p>Post mortem har fungert godt for oss og har vist seg å være et nyttig verktøy for trygg læring og strukturert problemløsning etter en hendelse. Vi anbefaler derfor å teste ut post mortem som en arena der alle involverte samles for læring kort tid etter at en hendelse er tatt hånd om. For at post mortem skal fungere godt, er psykologisk trygghet sentralt. Jobber du i en organisasjon der dette er på plass, er forutsetningene for å kunne lykkes med post mortem gode.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=ba50d96130c1\" width=\"1\" height=\"1\"><hr><p><a href=\"https://medium.com/sparebank1-digital/hendelsedrevet-l%C3%A6ring-i-sparebank-1-ba50d96130c1\">Hendelsedrevet læring i SpareBank 1</a> was originally published in <a href=\"https://medium.com/sparebank1-digital\">SpareBank 1 Utvikling</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"},"creator":"Kristoffer Berg"}}]}}}