{"data":{"markdownRemark":{"html":"<h2>Bli med å utvikle Norges råeste boliglånesøknad!</h2>\n<h4>Er du opptatt av kvalitet? Nysgjerrig? Liker å tenke nytt rundt problemstillinger?</h4>\n<p>Vi prøver å gjøre det enkelt og trygt å søke boliglån digitalt. Fra man drømmer om egen bolig, søker, finner, kjøper og eier sin bolig. Derfor fokuserer vi mye på å finne kundenes behov, prøve ut hypoteser og utvikle MVPer. Håper du har lyst til å jobbe sammen med oss!</p>\n<p>Team Boligreisen var året tidligere ute enn konkurrentene med det vi kaller «samtykkebasert lånesøknad», som vil si å hente inn lønnslipper og skattedata fra Altinn etter et samtykke fra kunden. Dette samarbeidet vant <a href=\"https://www.difi.no/nyhet/2018/06/samtykkebasert-lanesoknad-er-arets-digitale-suksesshistorie\">Digitaliseringsprisen i 2018</a>. Hos oss vil du bli en del av et tverrfaglig team med trivelige, dyktige og engasjerte kollegaer. Vi har også en balansert kjønnsfordeling og god aldersspredning. Teamet har høy grad av selvstendighet og stor takhøyde. Du får være med på å påvirke valg av både løsning, teknologi og arbeidsmåte – og ikke minst forme fremtidens boliglånesøknad. Bankene er opptatte av digitalisering av boliglånesøknaden, som står for en større andel av inntjeningen til bankene, så forretningssiden er også godt involvert i teamet.</p>\n<p>Vi er nysgjerrige på ny teknologi og hos oss er faglig individuell utvikling meget viktig. Teknologi endrer seg raskt og det er viktig å følge med. Ønsker du å utvide din horisont ved å lære mer så finnes det gode muligheter hos oss. Alle som jobber her har mulighet til å påvirke sin arbeidshverdag i stor grad. Vi har mange fagfora og flere hackathons hvert år. Som testutvikler vil du bli ansatt i en egen fagavdeling, Test &#x26; Kvalitet, som arrangerer sosiale arrangement og fagdager med spesielt fokus på nettopp test og kvalitet.</p>\n<p>For å nå våre mål ser vi nå etter gode testutviklere. Vi ser etter deg som er engasjert, faglig dyktig, nysgjerrig og opptatt av kvalitet. Med et ønske om å lage gode løsninger for både kunderådgivere og boliglånesøkere. Trives du også med å jobbe i team og er opptatt av raske tilbakemeldingssykluser så er det også et pluss.</p>\n<p>Våre foredrag på <a href=\"https://vimeo.com/album/4257283\">JavaZone og Smidigkonferansen</a> forteller om reisen vi er på, og hvordan vi er organisert. I vår <a href=\"https://medium.com/sparebank1-digital\">blogg</a> kan du lese mer om hvordan vi jobber.</p>\n<h4>Arbeidsoppgaver</h4>\n<ul>\n<li>Videreutvikle løsninger som brukes av en million mennesker hver eneste dag</li>\n<li>Bidra i alle faser av utviklingsprosessen, fra idé til produksjon</li>\n<li>Gjøre feil- og problemanalyse</li>\n<li>Bidra til kontinuerlig forbedring av arkitektur, arbeidsprosess og kode.</li>\n<li>Delta i avdelingens øvrige arbeid</li>\n</ul>\n<h4>Kvalifikasjoner</h4>\n<ul>\n<li>Erfaring med Java, Kotlin</li>\n<li>Erfaring med å utvikle rike grensesnitt med JavaScript, React/Redux eller andre rammeverk</li>\n<li>Glad i å jobbe på Linux-plattformen</li>\n<li>Høyere utdanning på universitets- eller høyskolenivå</li>\n</ul>\n<h4>Egenskaper</h4>\n<ul>\n<li>Selvdrevet og løsningsorientert</li>\n<li>Liker å lære nye ting</li>\n<li>Evne til å håndtere komplekse problemer</li>\n<li>Samarbeider godt med andre</li>\n<li>God til å kommunisere – både skriftlig og muntlig</li>\n</ul>\n<h4>Vi tilbyr</h4>\n<ul>\n<li>Trivelige kollegaer i et topp arbeids- og kompetansemiljø, og et av Norges største utviklingsmiljøer</li>\n<li>Utfordrende og varierte arbeidsoppgaver på strategisk viktige satsningsområder</li>\n<li>Gode muligheter for faglig og personlig utvikling. Vi tester nå ut fagdag en gang i uken for alle utviklere.</li>\n<li>Familievennlig arbeidstid med fleksibilitet i hverdagen og sommertid</li>\n<li>Moderne lokaler sentralt i Oslo</li>\n<li>Kaffebar, treningsrom, diverse idrettslag og sosiale aktiviteter</li>\n<li>Gode pensjons-, bank- og forsikringsordninger</li>\n</ul>\n<h4>Om oss</h4>\n<p>SpareBank 1 Banksamarbeidet DA er eid av 14 selvstendige SpareBank 1-banker og er et innovasjons- og utviklingsselskap for tjenester og løsninger i SpareBank 1-alliansen. Selskapet har 250 ansatte med oppgaver innen IT, markeds- og forretningsutvikling. Selskapet er en proaktiv og innovativ samarbeidspartner og fasilitator for SpareBank 1-bankene.\nSpareBank 1 Banksamarbeidet DA er ansvarlig for å utvikle og levere felles IT- og mobilløsninger, merkevare og markedsføringskonsepter, forretningskonsepter, produkter og tjenester, kompetanse, analyse, prosesser, beste praksisløsninger og innkjøp.</p>\n<p>Ved spørsmål om stillingene kontakt teamleder <strong>Brit Kristin Kaaresen</strong> på telefon <strong>988 60 034</strong>.</p>\n<p><strong>Søknadsfrist 2. mai</strong></p>\n<p><a href=\"https://www.webcruiter.no/WcMain/CvJobRespond1.aspx?company_id=2870757501&#x26;oppdragsnr=4045674140\">Send inn din søknad</a></p>","frontmatter":{"date":null,"path":"/utvikler-boligreisen","title":"Testutvikler til Team Boligreisen"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}