[
  {
  "heading": "Stand 1: Makuladegenerasjon (forkalkning)",
  "text": "Makuladegenerasjon er en sykdom som gir skade i skarpsynsområdet i øyet (makula). Den er en av de vanligste grunnene til synstap for personer over 50 år, men finnes også blant yngre.\n\nFørst blir det ofte vanskeligere å lese, kjenne igjen ansikter og se fine detaljer.\n\nEtter hvert kan ting midt i synsfeltet se mer sløret eller forvrengt ut. Til slutt kan området i midten av synsfeltet bli mørkt, så vi ikke kan se ting som er rett foran oss.",
  "tasks": "Oppgave",
  "task1": "Ta på deg simuleringsbrillene",
  "task2": "Gå inn på kamera-appen på mobilen din, og ta en selfie!",
  "task3": "Del bildet med noen på Slack, eller SMS",
  "color": "fjell",
  "hands": false
  },
  {
    "heading": "Stand 2: Grønn stær",
    "text": "Grønn stær er en tilstand som ofte skyldes høyt trykk inne i øyet. Etter hvert kan den gi innskrenkninger i synsfeltet og ubehandlet kan vi ende opp med «tunnelsyn».\n\nGrønn stær er en av de vanligste grunnene til blindhet i Norge, særlig i høy alder.\n\nDet estimeres at 2-3 prosent av befolkningen over 40 år har grønn stær, og 15-20 prosent av befolkningen over 70 år har det.",
    "tasks": "Oppgave",
    "task1": "Ta på deg simuleringsbrillene",
    "task2": "Hent opp din favoritt-app på telefonen",
    "task3": "Finn ut hvordan den oppleves med brillene på",
    "color": "syrin",
    "hands": false
  },
  {
    "heading": "Stand 3: Grå stær",
    "text": "Grå stær er en sykdom der linsen i øyet mister klarheten. Den gir først og fremst svekket syn, «tåkesyn», både på avstand og på nært hold.\n\nSelv om alder er den viktigste grunnen til grå stær blir noen barn faktisk født med denne sykdommen.\nEn tredjedel av alle over 65 år har grå stær.\nHos yngre oppstår grå stær oftest etter skader eller sykdom.",
    "tasks": "Oppgave",
    "task1": "Ta på deg simuleringsbrillene",
    "task2": "Gå inn på kalenderen på telefonen",
    "task3": "Hvordan er det å få oversikt over aktivitetene dine for denne uken?",
    "color": "frost",
    "hands": false
  },
  {
    "heading": "Stand 4: Tremor (skjelving)",
    "text": "Tremor er det samme som skjelving. Dette er en ufrivillig, rytmisk, ofte vedvarende aktivering av muskulaturen. \n\nOfte finner ikke legen årsaken til tremor og den kalles da isolert tremor. Den vanligste formen for isolert tremor er essentiell tremor. Dette er en tremor som rammer hendene våre spesielt. \n\nI tillegg kan mange også få litt tremor i nakken/hodet. Det kalles hodetremor.",
    "tasks": "Oppgave",
    "task1": "Ta på deg simuleringshanskene",
    "task2": "Gå inn på yr.no i nettleseren på mobilen",
    "task3": "Finn værvarselet for i morgen på ditt hjemsted",
    "color": "sand",
    "hands": true,
    "warningMessage": "Forsiktighetsregler ved bruk av simuleringshanskene..."
  },
  {
    "heading": "Stand 5: Diabetes retinopati",
    "text": "Diabetes retinopati betyr sykdom i øyets netthinne (retina) som følge av diabetes.\n\nDette er den viktigste enkeltårsaken til at personer i yrkesaktiv alder i vestlige land mister synet, helt eller delvis.\n\nPersoner med diabetes retinopati kan blant annet oppleve flekker i synsfeltet, sløret syn og svekket kontrastsyn.",
    "tasks": "Oppgave",
    "task1": "Ta på deg simuleringsbrillene",
    "task2": "Gå inn på sparebank1.no, i nettleseren på mobilen",
    "task3": "Trykk på oversikten over alle bankene",
    "task4": "Hvilken bank har slagordet «Tett på kundenes behov»?",
    "color": "fjell",
    "hands": false
  },
  {
    "heading": "Stand 6: Netthinneløsning",
    "text": "Symptomer på netthinneløsning er at synet brått forsvinner. Mange beskriver det som at en «gardin» dras for synsfeltet.\n\n Det er en akutt tilstand som fører til blindhet hvis den ikke opereres. Jo tidligere den blir operert, jo større sjanse er det for å få netthinnen på plass, og bevare mest mulig av synet.\n\n Vi kan få netthinneløsning i alle aldre, men det er mest vanlig blant eldre.",
    "tasks": "Oppgave",
    "task1": "Ta på deg simuleringsbrillene",
    "task2": "Gå til nrk.no i nettleseren på mobilen",
    "task3": "Se om du kan finne Urix",
    "color": "syrin",
    "hands": false
  },
  {
    "heading": "Stand 7: Retinitis pigmentosa",
    "text": "Retinitis pigmentosa (RP) er fellesbetegnelse for flere, hovedsakelig arvelige, netthinnesykdommer.\n\n Det er en av de vanligste grunnene til alvorlig nedsatt syn hos barn og yngre voksne. \n\nSom regel starter RP med at mørkesynet blir dårligere (nattblindhet). Senere er det et stadig mer innsnevret synsfelt (bortfall av sidesyn) som gir de største utfordringene for personer med denne sykdommen.",
    "tasks": "Oppgave",
    "task1": "Ta på deg simuleringsbrillene",
    "task2": "Gå inn på bildeappen på telefonen din, og se på bildene med brillene på",
    "task3": "Hva er annerledes?",
    "color": "frost",
    "hands": false
  }
]