{"data":{"markdownRemark":{"html":"<p>SB1 Utvikling hjelper bankene og produktselskapene i SB1 Alliansen med å være konkurransedyktige både nå og i fremtiden. For å bidra med dette holder SB1 Utvikling nå på å etablere en avdeling som skal jobbe med arkitektur- og teknologistyring og -utvikling. Målsetningen er å få:</p>\n<ul>\n<li>Tett samhandling med forretningssiden for å forstå behov og gi gode råd om alternativer og konsekvenser</li>\n<li>Proaktiv arkitektur- og teknologiutvikling for å utnytte muligheter og sikre konkurranseevne på kort og lang sikt</li>\n<li>Effektiv og tydelig arkitektur- og teknologistyring for å sikre fleksibilitet og kostnadsoptimalisering</li>\n</ul>\n<p>For å få til dette må vi jobbe tett med fagmiljø både i SB1 Utvikling samt ute i banker og produktselskaper. Vi må bistå team, prosjekter og initiativ med hensiktsmessige valg av arkitektur og teknologi samtidig som vi jobber for at våre løsninger henger sammen på tvers samt møter behov på kort og lengre sikt. En viktig del av dette arbeidet er å utarbeide og forvalte målbilder og strategier for arkitektur og teknologi. Avdelingen vil dekke en rekke arkitekturperspektiv fra virksomhetsarkitektur, informasjonsarkitektur og løsningsarkitektur til teknologiarkitektur, driftsarkitektur og skyarkitektur.</p>\n<p>Hvis du vil være med på reisen vil du få muligheten til å jobbe med en rekke spennende problemstillinger som:</p>\n<ul>\n<li>Hvordan skal vi utnytte skytjenester og hvordan skal disse spille sammen med andre plattformer og løsninger?</li>\n<li>Hvordan kan vi sikre god utnyttelse av data og hvordan kan vi understøtte økt bruk av maskinlæring?</li>\n<li>Hvordan får vi bedre kundeinnsikt og setter kunden i senter for vår arkitektur og løsninger?</li>\n<li>Hva er sentrale egenskaper ved våre ulike arkitekturer?</li>\n<li>Hvordan legger vi til rette for samspill mellom kanaler og deltagelse i økosystem?</li>\n<li>Hvordan realiserer vi fleksibilitet i løsninger og plattformer samtidig som de er kostnadseffektive og forvaltbare?</li>\n<li>Hvilke arkitekturer trenger vi for å understøtte forretningsbehov og hvordan sikrer vi at disse spiller godt sammen?</li>\n<li>Hvilke endringer i teknologilandskapet ser vi fremover og hvordan kan vi best nyttiggjøre oss disse?</li>\n<li>Hvordan kan vi best utøve arkitekturstyring i en kompleks virksomhet og som understøtter kontinuerlige leveranser?</li>\n</ul>\n<p>Flere stillinger vil legges ut i august/september, men hvis du er interessert så ta en prat med leder for Arkitektur og Teknologi Vegard Hartmann på telefon <a href=\"tel:+4798219319\">982 19 319</a> eller e-post <a href=\"mailto:vegard.hartmann@sparebank1.no\">vegard.hartmann@sparebank1.no</a>.</p>","frontmatter":{"date":null,"path":"/arkitekter","title":"Arkitekter til vår nye avdeling","description":"Har du lyst til å bli med å forme vår reise mot fremtiden? Vi etablerer en arkitekturavdeling som skal sette retning og løfte oss inn i vår teknologiske fremtid."}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}