{"data":{"markdownRemark":{"html":"<h2>Har du lyst til å bli med på å gjøre 2019 til vårt mest spennende år?</h2>\n<p>Vi søker deg som ikke er redd for å utfordre vedtatte sannheter og som kan være med på å bringe vårt team som utvikler SpareBank 1 sine sikkerhetsløsninger videre. Du vil jobbe med noe som påvirker hverdagen til veldig mange mennesker, og fokuserer derfor mye på å finne kundenes behov, utvikle MVPer og sørger for at våre løsninger er langt framme teknologisk.</p>\n<p>Til Team Tillitstjenester ser vi nå etter flere utviklere som har kompetanse innen sikkerhet. Hos oss vil du bli en del av et kryssfunksjonelt team bestående av utviklere, testere og representanter fra forretningssiden. Teamet har ansvar for vår sikkerhetskjerne som gir over en million kunder og ansatte trygg og effektiv tilgang til SpareBank 1 sine løsninger. Vi har tydelig ansvar, kombinert med frihet og tillit, og får selv bestemme valg av løsning, teknologi og arbeidsmåte.</p>\n<p>Vi er veldig nysgjerrige på ny teknologi og hos oss er faglig individuell utvikling utrolig viktig. Teknologi beveger seg raskt og det er viktig å følge med. Ønsker du å utvide din horisont ved å lære mer om for eksempel maskinlæring eller funksjonell programmering så finnes det gode muligheter for det her. Alle som jobber her har mulighet til å påvirke sin arbeidshverdag i stor grad. Vi har mange fagforum og som en del av å bli enda flinkere faglig, tester vi nå en egen ukentlig fagdag for utviklere.</p>\n<p>Våre foredrag på <a href=\"https://vimeo.com/album/4257283\">JavaZone og Smidigkonferansen</a> forteller om reisen vi er på, og hvordan vi er organisert. I vår <a href=\"https://medium.com/sparebank1-digital\">blogg</a> kan du lese mer om hvordan vi jobber.</p>\n<h4>Arbeidsoppgaver</h4>\n<ul>\n<li>Videreutvikle løsninger som brukes av en million mennesker hver eneste dag</li>\n<li>Bidra i alle faser av utviklingsprosessen, fra idé til produksjon</li>\n<li>Gjøre feil- og problemanalyse</li>\n<li>Bidra til kontinuerlig forbedring av arkitektur, arbeidsprosess og kode.</li>\n<li>Delta i avdelingens øvrige arbeid</li>\n</ul>\n<h4>Kvalifikasjoner</h4>\n<ul>\n<li>Erfaring med Java</li>\n<li>Fordel med kjennskap til sikkerhetsområdet, bl.a. BankID, SAML, OAuth, signering, sertifikater, single sign-on</li>\n<li>Glad i å jobbe på Linux-plattformen</li>\n<li>Høyere utdanning på universitets- eller høyskolenivå</li>\n<li>God norskspråklig kompetanse</li>\n</ul>\n<h4>Personlinge egenskaper</h4>\n<ul>\n<li>Selvdrevet og løsningsorientert</li>\n<li>Liker å lære nye ting</li>\n<li>Evne til å håndtere komplekse problemer</li>\n<li>Samarbeider godt med andre</li>\n<li>God til å kommunisere – både skriftlig og muntlig</li>\n</ul>\n<h4>Vi tilbyr</h4>\n<ul>\n<li>Gode muligheter for faglig og personlig utvikling. Vi tester nå ut fagdag en gang i uken for alle utviklere.</li>\n<li>Utfordrende og varierte arbeidsoppgaver på strategisk viktige satsningsområder</li>\n<li>Trivelige kollegaer i et topp arbeids- og kompetansemiljø</li>\n<li>Konkurransedyktige betingelser</li>\n<li>Gode pensjons- og forsikringsordninger</li>\n<li>Familievennlig arbeidstid – med fleksibilitet i hverdagen og sommertid</li>\n<li>Moderne lokaler sentralt i Oslo</li>\n<li>Kaffebar, treningsrom, diverse idrettslag og sosiale aktiviteter</li>\n</ul>\n<h4>Om oss</h4>\n<p>SpareBank 1 Banksamarbeidet DA er eid av 14 selvstendige SpareBank 1-banker og er et innovasjons- og utviklingsselskap for tjenester og løsninger i SpareBank 1-alliansen. Selskapet har 250 ansatte med oppgaver innen IT, markeds- og forretningsutvikling. Selskapet er en proaktiv og innovativ samarbeidspartner og fasilitator for SpareBank 1-bankene.\nSpareBank 1 Banksamarbeidet DA er ansvarlig for å utvikle og levere felles IT- og mobilløsninger, merkevare og markedsføringskonsepter, forretningskonsepter, produkter og tjenester, kompetanse, analyse, prosesser, beste praksisløsninger og innkjøp.</p>\n<p>Nysgjerrig på miljøet vårt? Ta gjerne kontakt med <strong>teamleder Magnus på 411 43 776</strong> for en uformell prat. Vi vurderer kandidater løpende.</p>\n<p><strong>Søknadsfrist 20. mai</strong></p>\n<p><a href=\"https://www.webcruiter.no/WcMain/CvJobrespond1.aspx?oppdragsnr=4060441491&#x26;culture_id=NB-NO\">Send inn din søknad</a></p>","frontmatter":{"date":null,"path":"/utvikler-java","title":"Utviklere med Java-erfaring og kjennskap til sikkerhet"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}